{"class_name": "Model", "keras_version": "2.1.4-tf", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 3], "name": "conv2d_1_input", "sparse": false}, "inbound_nodes": [], "name": "conv2d_1_input"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 24, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "batch_input_shape": [null, 224, 224, 3], "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv2d_1_input", 0, 0, {}]]], "name": "conv2d_1"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_1"}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "activation_1"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 24, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "conv2d_2"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_2"}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "activation_2"}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "max_pooling2d_1"}, {"class_name": "Dropout", "config": {"name": "dropout_1", "dtype": "float32", "trainable": true, "rate": 0.25, "seed": null, "noise_shape": null}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "dropout_1"}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 48, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "conv2d_3"}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "relu", "trainable": true, "name": "activation_3"}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "activation_3"}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "max_pooling2d_2"}, {"class_name": "Flatten", "config": {"dtype": "float32", "trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "flatten_1"}, {"class_name": "LeakyReLU", "config": {"dtype": "float32", "trainable": true, "name": "leaky_re_lu_1", "alpha": 0.30000001192092896}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "leaky_re_lu_1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 10, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]], "name": "dense_1"}, {"class_name": "Dropout", "config": {"name": "dropout_2", "dtype": "float32", "trainable": true, "rate": 0.2, "seed": null, "noise_shape": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dropout_2"}, {"class_name": "LeakyReLU", "config": {"dtype": "float32", "trainable": true, "name": "leaky_re_lu_2", "alpha": 0.30000001192092896}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "leaky_re_lu_2"}, {"class_name": "Dropout", "config": {"name": "dropout_3", "dtype": "float32", "trainable": true, "rate": 0.3, "seed": null, "noise_shape": null}, "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]], "name": "dropout_3"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "RandomNormal", "config": {"dtype": "float32", "seed": null, "stddev": 1.0, "mean": 0.0}}, "name": "dense_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "name": "dense_2"}], "input_layers": [["conv2d_1_input", 0, 0]], "output_layers": [["dense_2", 0, 0]], "name": "model_1"}, "backend": "tensorflow"}